yamamo2shun1/JUMBLEQ/STM32CubeIDE/JUMBLEQ/Appli/Core/Src/audio_diagnostics.c
/*
 * audio_diagnostics.c
 *
 * Audio diagnostics state, recording helpers and the periodic RTT summary.
 *
 * All record functions are called from ISR context and only update fixed-size
 * counters/min-max values. RTT output happens exclusively in the Audio Task
 * through audio_diagnostics_log_periodic().
 */

#include "audio_diagnostics_internal.h"

#include "SEGGER_RTT.h"
#include "stm32h7rsxx_hal.h"

#include "SigmaStudioFW.h"

#define DBG_MIN_U32_INIT UINT32_MAX

enum
{
    DBG_MIN_U16_INIT = 0xFFFFu,
    AUDIO_USB_HS_MICROFRAMES_PER_SECOND = 8000u,
};

volatile AudioTxDiagnostics_t g_audio_tx_diagnostics = {
    .tx_used_min_words = UINT32_MAX,
};

volatile AudioRxDiagnostics_t g_audio_rx_diagnostics = {0};
volatile AudioRecoveryDiagnostics_t g_audio_recovery_diagnostics = {0};
// state=1はAudioRateState_tのSWITCHING（初期適用確認前）を表す。
volatile AudioRateSwitchDiagnostics_t g_audio_rate_switch_diagnostics = {
    .state = 1u,
};

#if AUDIO_DIAG_LOG
static volatile uint32_t dbg_tx_used_min            = DBG_MIN_U32_INIT;
static volatile uint32_t dbg_tx_used_max            = 0u;
static volatile uint32_t dbg_tx_underrun_events     = 0u;
static volatile uint32_t dbg_tx_partial_fill_events = 0u;
static volatile uint32_t dbg_tx_drift_up_events     = 0u;
static volatile uint32_t dbg_tx_drift_dn_events     = 0u;
static volatile uint32_t dbg_usb_read_zero_events   = 0u;
static volatile uint32_t dbg_usb_read_bytes         = 0u;
static volatile uint32_t dbg_dma_err_events         = 0u;
static volatile uint32_t dbg_sai_tx_err_events      = 0u;
static volatile uint32_t dbg_sai_rx_err_events      = 0u;
static volatile uint32_t dbg_sai_tx_last_err        = 0u;
static volatile uint32_t dbg_sai_rx_last_err        = 0u;
static volatile uint32_t dbg_sai_tx_sr_flags        = 0u;
static volatile uint32_t dbg_sai_rx_sr_flags        = 0u;
static uint32_t dbg_sigma_calls_prev                = 0u;
static uint32_t dbg_sigma_err_prev                  = 0u;
static uint32_t dbg_sigma_to_prev                   = 0u;
static uint32_t dbg_sigma_mto_prev                  = 0u;
static volatile uint32_t dbg_tx_half_rewrite_events = 0u;
static volatile uint32_t dbg_tx_cplt_rewrite_events = 0u;
static volatile uint32_t dbg_rx_half_rewrite_events = 0u;
static volatile uint32_t dbg_rx_cplt_rewrite_events = 0u;
static volatile uint16_t dbg_usb_read_size_min      = DBG_MIN_U16_INIT;
static volatile uint16_t dbg_usb_read_size_max      = 0u;
static volatile uint32_t dbg_usb_out_packet_events  = 0u;
static volatile uint32_t dbg_usb_out_packet_bytes   = 0u;
static volatile uint16_t dbg_usb_out_packet_size_min = DBG_MIN_U16_INIT;
static volatile uint16_t dbg_usb_out_packet_size_max = 0u;
static volatile uint32_t dbg_usb_out_gap_cycles_min = DBG_MIN_U32_INIT;
static volatile uint32_t dbg_usb_out_gap_cycles_max = 0u;
static volatile uint32_t dbg_usb_out_gap_late_events = 0u;
static volatile uint32_t dbg_usb_out_prev_cycle     = 0u;
static volatile bool dbg_usb_out_prev_cycle_valid   = false;
static volatile uint32_t dbg_usb_out_coalesced_events = 0u;
static volatile uint32_t dbg_usb_out_pending_cycle  = 0u;
static volatile uint32_t dbg_usb_out_service_cycles_min = DBG_MIN_U32_INIT;
static volatile uint32_t dbg_usb_out_service_cycles_max = 0u;
static volatile uint16_t dbg_usb_out_fifo_min       = DBG_MIN_U16_INIT;
static volatile uint16_t dbg_usb_out_fifo_max       = 0u;
static volatile uint32_t dbg_usb_in_packet_events   = 0u;
static volatile uint32_t dbg_usb_in_packet_zero_events = 0u;
static volatile uint32_t dbg_usb_in_packet_bytes    = 0u;
static volatile uint16_t dbg_usb_in_packet_size_min = DBG_MIN_U16_INIT;
static volatile uint16_t dbg_usb_in_packet_size_max = 0u;
static volatile uint32_t dbg_usb_in_notify_events   = 0u;
static volatile uint32_t dbg_usb_in_source_wait_events = 0u;
static volatile uint32_t dbg_usb_in_write_zero_events = 0u;
static volatile uint32_t dbg_usb_in_write_partial_events = 0u;
static volatile uint32_t dbg_usb_in_write_bytes     = 0u;
static volatile uint16_t dbg_usb_in_fifo_min        = DBG_MIN_U16_INIT;
static volatile uint16_t dbg_usb_in_fifo_max        = 0u;

static void audio_diag_reset_interval_locked(void)
{
    dbg_tx_used_min            = DBG_MIN_U32_INIT;
    dbg_tx_used_max            = 0u;
    dbg_tx_underrun_events     = 0u;
    dbg_tx_partial_fill_events = 0u;
    dbg_tx_drift_up_events     = 0u;
    dbg_tx_drift_dn_events     = 0u;
    dbg_usb_read_zero_events   = 0u;
    dbg_usb_read_bytes         = 0u;
    dbg_dma_err_events         = 0u;
    dbg_sai_tx_err_events      = 0u;
    dbg_sai_rx_err_events      = 0u;
    dbg_sai_tx_last_err        = 0u;
    dbg_sai_rx_last_err        = 0u;
    dbg_sai_tx_sr_flags        = 0u;
    dbg_sai_rx_sr_flags        = 0u;
    dbg_tx_half_rewrite_events = 0u;
    dbg_tx_cplt_rewrite_events = 0u;
    dbg_rx_half_rewrite_events = 0u;
    dbg_rx_cplt_rewrite_events = 0u;
    dbg_usb_read_size_min      = DBG_MIN_U16_INIT;
    dbg_usb_read_size_max      = 0u;
    dbg_usb_out_packet_events  = 0u;
    dbg_usb_out_packet_bytes   = 0u;
    dbg_usb_out_packet_size_min = DBG_MIN_U16_INIT;
    dbg_usb_out_packet_size_max = 0u;
    dbg_usb_out_gap_cycles_min = DBG_MIN_U32_INIT;
    dbg_usb_out_gap_cycles_max = 0u;
    dbg_usb_out_gap_late_events = 0u;
    dbg_usb_out_coalesced_events = 0u;
    dbg_usb_out_service_cycles_min = DBG_MIN_U32_INIT;
    dbg_usb_out_service_cycles_max = 0u;
    dbg_usb_out_fifo_min       = DBG_MIN_U16_INIT;
    dbg_usb_out_fifo_max       = 0u;
    dbg_usb_in_packet_events   = 0u;
    dbg_usb_in_packet_zero_events = 0u;
    dbg_usb_in_packet_bytes    = 0u;
    dbg_usb_in_packet_size_min = DBG_MIN_U16_INIT;
    dbg_usb_in_packet_size_max = 0u;
    dbg_usb_in_notify_events   = 0u;
    dbg_usb_in_source_wait_events = 0u;
    dbg_usb_in_write_zero_events = 0u;
    dbg_usb_in_write_partial_events = 0u;
    dbg_usb_in_write_bytes     = 0u;
    dbg_usb_in_fifo_min        = DBG_MIN_U16_INIT;
    dbg_usb_in_fifo_max        = 0u;
}

static uint32_t audio_diag_cycles_to_us(uint32_t cycles)
{
    if (SystemCoreClock == 0u)
    {
        return 0u;
    }

