yamamo2shun1/JUMBLEQ/STM32CubeIDE/JUMBLEQ/Appli/Core/Src/audio_diagnostics.c
    return (uint32_t) ((((uint64_t) cycles * 1000000u) + (SystemCoreClock / 2u)) / SystemCoreClock);
}
#endif

void audio_diagnostics_reset_tx_locked(void)
{
    const uint32_t reset_count = g_audio_tx_diagnostics.reset_count + 1u;
    AudioTxDiagnostics_t reset = {0};
    reset.reset_count          = reset_count;
    reset.tx_used_min_words    = UINT32_MAX;
    g_audio_tx_diagnostics     = reset;
}

#if AUDIO_DIAG_LOG
void audio_diagnostics_reset_interval(void)
{
    const uint32_t primask = __get_PRIMASK();
    __disable_irq();

    audio_diag_reset_interval_locked();

    __set_PRIMASK(primask);
}

void audio_diagnostics_reset_session(void)
{
    const uint32_t primask = __get_PRIMASK();
    __disable_irq();

    audio_diag_reset_interval_locked();
    dbg_usb_out_prev_cycle       = 0u;
    dbg_usb_out_prev_cycle_valid = false;
    dbg_usb_out_pending_cycle    = 0u;

    __set_PRIMASK(primask);
}

void audio_diagnostics_reset_usb_out_gap(void)
{
    dbg_usb_out_prev_cycle_valid = false;
}
#endif

void audio_diagnostics_record_tx_level(bool streaming, int32_t used)
{
    if (!streaming || used < 0)
    {
        return;
    }

    const uint32_t level = (uint32_t) used;
    if (level < g_audio_tx_diagnostics.tx_used_min_words)
    {
        g_audio_tx_diagnostics.tx_used_min_words = level;
    }
    if (level > g_audio_tx_diagnostics.tx_used_max_words)
    {
        g_audio_tx_diagnostics.tx_used_max_words = level;
    }
}

#if AUDIO_DIAG_LOG
void audio_diagnostics_record_tx_interval_level(int32_t used)
{
    if (used < 0)
    {
        return;
    }

    const uint32_t level = (uint32_t) used;
    if (level < dbg_tx_used_min)
    {
        dbg_tx_used_min = level;
    }
    if (level > dbg_tx_used_max)
    {
        dbg_tx_used_max = level;
    }
}
#endif

void audio_diagnostics_record_tx_priming_wait(void)
{
    g_audio_tx_diagnostics.priming_wait_events++;
}

void audio_diagnostics_record_tx_priming_complete(void)
{
    g_audio_tx_diagnostics.priming_completed_events++;
}

void audio_diagnostics_record_tx_drift_threshold(bool upward)
{
    if (upward)
    {
        g_audio_tx_diagnostics.drift_up_threshold_events++;
    }
    else
    {
        g_audio_tx_diagnostics.drift_down_threshold_events++;
    }
}

void audio_diagnostics_record_tx_drift_suppressed(bool upward)
{
    if (upward)
    {
        g_audio_tx_diagnostics.drift_up_suppressed_events++;
    }
    else
    {
        g_audio_tx_diagnostics.drift_down_suppressed_events++;
    }
}

void audio_diagnostics_record_tx_event(bool streaming, uint32_t flags, int32_t used)
{
    if (streaming)
    {
        if ((flags & AUDIO_TX_DIAG_EVENT_UNDERRUN) != 0u)
        {
            g_audio_tx_diagnostics.underrun_events++;
        }
        if ((flags & AUDIO_TX_DIAG_EVENT_PARTIAL_FILL) != 0u)
        {
            g_audio_tx_diagnostics.partial_fill_events++;
        }
        if ((flags & AUDIO_TX_DIAG_EVENT_DRIFT_UP) != 0u)
        {
            g_audio_tx_diagnostics.drift_up_events++;
        }
        if ((flags & AUDIO_TX_DIAG_EVENT_DRIFT_DOWN) != 0u)
        {
            g_audio_tx_diagnostics.drift_down_events++;
        }

        g_audio_tx_diagnostics.last_event_used_words = used;
        g_audio_tx_diagnostics.last_event_flags      = flags;
        g_audio_tx_diagnostics.last_event_tick_ms    = HAL_GetTick();
        g_audio_tx_diagnostics.last_event_cycle      = DWT->CYCCNT;
    }

#if AUDIO_DIAG_LOG
    if ((flags & AUDIO_TX_DIAG_EVENT_UNDERRUN) != 0u)
    {
        dbg_tx_underrun_events++;
    }
    if ((flags & AUDIO_TX_DIAG_EVENT_PARTIAL_FILL) != 0u)
    {
        dbg_tx_partial_fill_events++;
    }
    if ((flags & AUDIO_TX_DIAG_EVENT_DRIFT_UP) != 0u)
    {
        dbg_tx_drift_up_events++;
    }
    if ((flags & AUDIO_TX_DIAG_EVENT_DRIFT_DOWN) != 0u)
    {
        dbg_tx_drift_dn_events++;
    }
#endif
}

void audio_diagnostics_record_tx_dma_callback(uint32_t callback_event,
                                              uint32_t overwritten_event,
                                              bool streaming,
                                              int32_t used)
{
    if (streaming)
    {
        if (callback_event == AUDIO_DIAG_DMA_EVENT_HALF)
        {
            g_audio_tx_diagnostics.tx_half_callbacks++;
        }
        else
        {
            g_audio_tx_diagnostics.tx_cplt_callbacks++;
        }

        if (overwritten_event == AUDIO_DIAG_DMA_EVENT_HALF)
        {
            g_audio_tx_diagnostics.half_rewrite_events++;
            audio_diagnostics_record_tx_event(true, AUDIO_TX_DIAG_EVENT_HALF_REWRITE, used);
        }
        else if (overwritten_event == AUDIO_DIAG_DMA_EVENT_COMPLETE)
        {
            g_audio_tx_diagnostics.cplt_rewrite_events++;
            audio_diagnostics_record_tx_event(true, AUDIO_TX_DIAG_EVENT_CPLT_REWRITE, used);
        }
        g_audio_tx_diagnostics.last_pending_callback = callback_event;
    }

#if AUDIO_DIAG_LOG
    if (overwritten_event == AUDIO_DIAG_DMA_EVENT_HALF)
    {
        dbg_tx_half_rewrite_events++;
    }
    else if (overwritten_event == AUDIO_DIAG_DMA_EVENT_COMPLETE)
    {
        dbg_tx_cplt_rewrite_events++;
    }
#endif
}

void audio_diagnostics_record_rx_dma_callback(uint32_t callback_event,
                                              uint32_t overwritten_event)
{
    if (callback_event == AUDIO_DIAG_DMA_EVENT_HALF)
    {
        g_audio_rx_diagnostics.rx_half_callbacks++;
    }
    else
    {
        g_audio_rx_diagnostics.rx_cplt_callbacks++;
    }

    if (overwritten_event == AUDIO_DIAG_DMA_EVENT_HALF)
    {
        g_audio_rx_diagnostics.rx_half_rewrite_events++;
    }
    else if (overwritten_event == AUDIO_DIAG_DMA_EVENT_COMPLETE)
    {
        g_audio_rx_diagnostics.rx_cplt_rewrite_events++;
    }

#if AUDIO_DIAG_LOG
    if (overwritten_event == AUDIO_DIAG_DMA_EVENT_HALF)
    {
        dbg_rx_half_rewrite_events++;
    }
    else if (overwritten_event == AUDIO_DIAG_DMA_EVENT_COMPLETE)
    {
        dbg_rx_cplt_rewrite_events++;
    }
#endif
}

void audio_diagnostics_record_tx_dma_service(uint32_t callback_event,
                                             uint32_t service_cycles,
                                             bool deadline_overrun)
{
    if (callback_event == AUDIO_DIAG_DMA_EVENT_HALF)
    {
        if (service_cycles > g_audio_tx_diagnostics.half_service_cycles_max)
        {
            g_audio_tx_diagnostics.half_service_cycles_max = service_cycles;
        }
        if (deadline_overrun)
        {
            g_audio_tx_diagnostics.half_deadline_overruns++;
        }
    }
    else if (callback_event == AUDIO_DIAG_DMA_EVENT_COMPLETE)
    {
        if (service_cycles > g_audio_tx_diagnostics.cplt_service_cycles_max)
        {
            g_audio_tx_diagnostics.cplt_service_cycles_max = service_cycles;
        }
        if (deadline_overrun)
        {
            g_audio_tx_diagnostics.cplt_deadline_overruns++;
        }
    }
}

void audio_diagnostics_record_rx_dma_service(uint32_t callback_event,
                                             uint32_t service_cycles,
                                             bool deadline_overrun)
{
    if (callback_event == AUDIO_DIAG_DMA_EVENT_HALF)
    {
        if (service_cycles > g_audio_rx_diagnostics.rx_half_service_cycles_max)
        {
            g_audio_rx_diagnostics.rx_half_service_cycles_max = service_cycles;
        }
        if (deadline_overrun)
        {
            g_audio_rx_diagnostics.rx_half_deadline_overruns++;
        }
    }
    else if (callback_event == AUDIO_DIAG_DMA_EVENT_COMPLETE)
    {
        if (service_cycles > g_audio_rx_diagnostics.rx_cplt_service_cycles_max)
        {
            g_audio_rx_diagnostics.rx_cplt_service_cycles_max = service_cycles;
        }
        if (deadline_overrun)
        {
            g_audio_rx_diagnostics.rx_cplt_deadline_overruns++;
        }
    }
}

// DMA処理完了時間の記録。complete最大値の更新時に、そのイベントのdeadlineも
// 同時に保存する。deadline_cycles == UINT32_MAX（レート未確定）は期限超過に数えない。
void audio_diagnostics_record_tx_dma_complete(uint32_t callback_event,
                                              uint32_t process_cycles,
                                              uint32_t complete_cycles,
                                              uint32_t deadline_cycles)
{
    if (callback_event == AUDIO_DIAG_DMA_EVENT_HALF)
    {
        if (process_cycles > g_audio_tx_diagnostics.half_process_cycles_max)
        {
            g_audio_tx_diagnostics.half_process_cycles_max = process_cycles;
        }
        if (complete_cycles > g_audio_tx_diagnostics.half_complete_cycles_max)
        {
            g_audio_tx_diagnostics.half_complete_cycles_max = complete_cycles;
            g_audio_tx_diagnostics.half_complete_deadline_cycles_at_max = deadline_cycles;
        }
        if (complete_cycles > deadline_cycles)
        {
            g_audio_tx_diagnostics.half_complete_deadline_overruns++;
        }
    }
    else if (callback_event == AUDIO_DIAG_DMA_EVENT_COMPLETE)
    {
        if (process_cycles > g_audio_tx_diagnostics.cplt_process_cycles_max)
        {
            g_audio_tx_diagnostics.cplt_process_cycles_max = process_cycles;
        }
        if (complete_cycles > g_audio_tx_diagnostics.cplt_complete_cycles_max)
        {
            g_audio_tx_diagnostics.cplt_complete_cycles_max = complete_cycles;
            g_audio_tx_diagnostics.cplt_complete_deadline_cycles_at_max = deadline_cycles;
        }
        if (complete_cycles > deadline_cycles)
        {
            g_audio_tx_diagnostics.cplt_complete_deadline_overruns++;
        }
    }

    g_audio_tx_diagnostics.last_process_cycles           = process_cycles;
    g_audio_tx_diagnostics.last_complete_cycles          = complete_cycles;
    g_audio_tx_diagnostics.last_complete_deadline_cycles = deadline_cycles;
}

void audio_diagnostics_record_rx_dma_complete(uint32_t callback_event,
                                              uint32_t process_cycles,
                                              uint32_t complete_cycles,
                                              uint32_t deadline_cycles)
{
    if (callback_event == AUDIO_DIAG_DMA_EVENT_HALF)
    {
        if (process_cycles > g_audio_rx_diagnostics.rx_half_process_cycles_max)
        {
            g_audio_rx_diagnostics.rx_half_process_cycles_max = process_cycles;
        }
        if (complete_cycles > g_audio_rx_diagnostics.rx_half_complete_cycles_max)
        {
            g_audio_rx_diagnostics.rx_half_complete_cycles_max = complete_cycles;
            g_audio_rx_diagnostics.rx_half_complete_deadline_cycles_at_max = deadline_cycles;
        }
        if (complete_cycles > deadline_cycles)
        {
            g_audio_rx_diagnostics.rx_half_complete_deadline_overruns++;
        }
    }
    else if (callback_event == AUDIO_DIAG_DMA_EVENT_COMPLETE)
    {
        if (process_cycles > g_audio_rx_diagnostics.rx_cplt_process_cycles_max)
        {
            g_audio_rx_diagnostics.rx_cplt_process_cycles_max = process_cycles;
        }
        if (complete_cycles > g_audio_rx_diagnostics.rx_cplt_complete_cycles_max)
        {
            g_audio_rx_diagnostics.rx_cplt_complete_cycles_max = complete_cycles;
            g_audio_rx_diagnostics.rx_cplt_complete_deadline_cycles_at_max = deadline_cycles;
        }
        if (complete_cycles > deadline_cycles)
        {
            g_audio_rx_diagnostics.rx_cplt_complete_deadline_overruns++;
        }
    }

