yamamo2shun1/JUMBLEQ/STM32CubeIDE/JUMBLEQ/Appli/Core/Src/audio_diagnostics.c
    g_audio_rx_diagnostics.rx_last_process_cycles           = process_cycles;
    g_audio_rx_diagnostics.rx_last_complete_cycles          = complete_cycles;
    g_audio_rx_diagnostics.rx_last_complete_deadline_cycles = deadline_cycles;
}

void audio_diagnostics_record_tx_events_dropped(uint32_t last_event,
                                                uint32_t dropped_events,
                                                int32_t used)
{
    g_audio_tx_diagnostics.both_pending_events++;
    g_audio_tx_diagnostics.dma_events_dropped += dropped_events;
    g_audio_tx_diagnostics.both_pending_last_callback = last_event;
    audio_diagnostics_record_tx_event(true, AUDIO_TX_DIAG_EVENT_BOTH_PENDING, used);
}

void audio_diagnostics_record_rx_events_dropped(uint32_t last_event,
                                                uint32_t dropped_events)
{
    g_audio_rx_diagnostics.rx_both_pending_events++;
    g_audio_rx_diagnostics.rx_dma_events_dropped += dropped_events;
    g_audio_rx_diagnostics.rx_both_pending_last_callback = last_event;
}

void audio_diagnostics_record_rx_ring_discard(uint32_t dropped_words, bool full_discard)
{
    if (full_discard)
    {
        g_audio_rx_diagnostics.rx_ring_full_discards++;
        g_audio_rx_diagnostics.rx_last_discard_words = 0u;
    }
    else
    {
        g_audio_rx_diagnostics.rx_ring_discard_events++;
        g_audio_rx_diagnostics.rx_ring_discard_words += dropped_words;
        g_audio_rx_diagnostics.rx_last_discard_words = dropped_words;
    }
    g_audio_rx_diagnostics.rx_last_discard_tick_ms = HAL_GetTick();
}

void audio_diagnostics_record_dma_error(uint32_t error_code,
                                        bool tx_route,
                                        bool streaming,
                                        int32_t used)
{
    if (tx_route)
    {
        g_audio_tx_diagnostics.dma_error_events++;
        g_audio_tx_diagnostics.last_dma_error_code = error_code;
        audio_diagnostics_record_tx_event(streaming, AUDIO_TX_DIAG_EVENT_DMA_ERROR, used);
    }
    else
    {
        g_audio_rx_diagnostics.dma_error_events++;
        g_audio_rx_diagnostics.last_dma_error_code = error_code;
    }
#if AUDIO_DIAG_LOG
    dbg_dma_err_events++;
#endif
}

void audio_diagnostics_record_unknown_dma_error(uint32_t error_code)
{
    g_audio_recovery_diagnostics.unknown_dma_error_events++;
    g_audio_recovery_diagnostics.last_unknown_dma_error_code = error_code;
}

void audio_diagnostics_record_sai_tx_error(uint32_t error_code,
                                           uint32_t status_flags,
                                           bool streaming,
                                           int32_t used)
{
    g_audio_tx_diagnostics.sai_error_events++;
    g_audio_tx_diagnostics.last_sai_error_code   = error_code;
    g_audio_tx_diagnostics.last_sai_status_flags = status_flags;
    audio_diagnostics_record_tx_event(streaming, AUDIO_TX_DIAG_EVENT_SAI_ERROR, used);
#if AUDIO_DIAG_LOG
    dbg_sai_tx_err_events++;
    dbg_sai_tx_last_err = error_code;
    dbg_sai_tx_sr_flags |= status_flags;
#endif
}

void audio_diagnostics_record_sai_rx_error(uint32_t error_code,
                                           uint32_t status_flags)
{
    g_audio_rx_diagnostics.sai_error_events++;
    g_audio_rx_diagnostics.last_sai_error_code   = error_code;
    g_audio_rx_diagnostics.last_sai_status_flags = status_flags;
#if AUDIO_DIAG_LOG
    dbg_sai_rx_err_events++;
    dbg_sai_rx_last_err = error_code;
    dbg_sai_rx_sr_flags |= status_flags;
#endif
}

void audio_diagnostics_record_recovery_request(uint32_t cause_mask,
                                               uint32_t dma_error_code,
                                               uint32_t sai_error_code,
                                               uint32_t sai_status_flags)
{
    g_audio_recovery_diagnostics.request_count++;
    g_audio_recovery_diagnostics.last_cause_mask               = cause_mask;
    g_audio_recovery_diagnostics.last_request_dma_error_code   = dma_error_code;
    g_audio_recovery_diagnostics.last_request_sai_error_code   = sai_error_code;
    g_audio_recovery_diagnostics.last_request_sai_status_flags = sai_status_flags;
    g_audio_recovery_diagnostics.last_request_tick_ms          = HAL_GetTick();
}

void audio_diagnostics_record_recovery_attempt(void)
{
    g_audio_recovery_diagnostics.attempt_count++;
    g_audio_recovery_diagnostics.last_attempt_tick_ms = HAL_GetTick();
}

void audio_diagnostics_record_recovery_success(void)
{
    g_audio_recovery_diagnostics.success_count++;
    g_audio_recovery_diagnostics.consecutive_failures = 0u;
    g_audio_recovery_diagnostics.last_success_tick_ms = HAL_GetTick();
}

void audio_diagnostics_record_recovery_failure(uint32_t failed_stage)
{
    g_audio_recovery_diagnostics.failure_count++;
    g_audio_recovery_diagnostics.consecutive_failures++;
    g_audio_recovery_diagnostics.last_failed_stage = failed_stage;
    g_audio_recovery_diagnostics.last_failure_tick_ms = HAL_GetTick();
}

void audio_diagnostics_set_recovery_latched(bool latched)
{
    g_audio_recovery_diagnostics.latched = latched ? 1u : 0u;
    if (!latched)
    {
        g_audio_recovery_diagnostics.consecutive_failures = 0u;
    }
}

void audio_diagnostics_update_rate_snapshot(uint32_t state,
                                            uint32_t applied_hz,
                                            uint32_t applied_valid,
                                            uint32_t clock_valid)
{
    const uint32_t primask = __get_PRIMASK();
    __disable_irq();

    g_audio_rate_switch_diagnostics.state         = state;
    g_audio_rate_switch_diagnostics.last_applied_hz = applied_hz;
    g_audio_rate_switch_diagnostics.applied_valid = applied_valid ? 1u : 0u;
    g_audio_rate_switch_diagnostics.clock_valid   = clock_valid ? 1u : 0u;

    __set_PRIMASK(primask);
}

void audio_diagnostics_record_rate_switch_attempt(uint32_t target_hz, uint32_t sequence)
{
    g_audio_rate_switch_diagnostics.attempt_count++;
    g_audio_rate_switch_diagnostics.last_target_hz = target_hz;
    g_audio_rate_switch_diagnostics.last_sequence  = sequence;
    g_audio_rate_switch_diagnostics.last_attempt_tick_ms = HAL_GetTick();
}

void audio_diagnostics_record_rate_switch_noop(uint32_t target_hz, uint32_t sequence)
{
    g_audio_rate_switch_diagnostics.noop_count++;
    g_audio_rate_switch_diagnostics.last_target_hz = target_hz;
    g_audio_rate_switch_diagnostics.last_sequence  = sequence;
}

void audio_diagnostics_record_rate_switch_success(uint32_t applied_hz)
{
    g_audio_rate_switch_diagnostics.success_count++;
    g_audio_rate_switch_diagnostics.last_applied_hz    = applied_hz;
    g_audio_rate_switch_diagnostics.last_success_tick_ms = HAL_GetTick();
}

void audio_diagnostics_record_rate_switch_failure(uint32_t failed_result,
                                                  uint32_t failed_stage,
                                                  uint32_t hal_status,
                                                  uint32_t aux_status)
{
    g_audio_rate_switch_diagnostics.failure_count++;
    g_audio_rate_switch_diagnostics.last_failed_result     = failed_result;
    g_audio_rate_switch_diagnostics.last_failed_stage      = failed_stage;
    g_audio_rate_switch_diagnostics.last_failed_hal_status = hal_status;
    g_audio_rate_switch_diagnostics.last_failed_aux_status = aux_status;
    g_audio_rate_switch_diagnostics.last_failure_tick_ms   = HAL_GetTick();
}

void audio_diagnostics_record_rate_switch_cleanup(uint32_t cleanup_status)
{
    g_audio_rate_switch_diagnostics.last_cleanup_status = cleanup_status;
}

#if AUDIO_DIAG_LOG
void audio_diagnostics_record_usb_out_packet(uint16_t bytes,
                                             uint32_t rx_cycle,
                                             bool pending)
{
    dbg_usb_out_packet_events++;
    dbg_usb_out_packet_bytes += bytes;
    if (bytes < dbg_usb_out_packet_size_min)
    {
        dbg_usb_out_packet_size_min = bytes;
    }
    if (bytes > dbg_usb_out_packet_size_max)
    {
        dbg_usb_out_packet_size_max = bytes;
    }

    if (dbg_usb_out_prev_cycle_valid)
    {
        const uint32_t gap_cycles = rx_cycle - dbg_usb_out_prev_cycle;
        const uint32_t expected_cycles = SystemCoreClock / AUDIO_USB_HS_MICROFRAMES_PER_SECOND;
        const uint32_t late_threshold_cycles = expected_cycles + (expected_cycles / 2u);

        if (gap_cycles < dbg_usb_out_gap_cycles_min)
        {
            dbg_usb_out_gap_cycles_min = gap_cycles;
        }
        if (gap_cycles > dbg_usb_out_gap_cycles_max)
        {
            dbg_usb_out_gap_cycles_max = gap_cycles;
        }
        if (gap_cycles > late_threshold_cycles)
        {
            dbg_usb_out_gap_late_events++;
        }
    }
    dbg_usb_out_prev_cycle       = rx_cycle;
    dbg_usb_out_prev_cycle_valid = true;

