yamamo2shun1/JUMBLEQ/STM32CubeIDE/JUMBLEQ/Appli/Core/Src/audio_diagnostics.c
    if (pending)
    {
        dbg_usb_out_coalesced_events++;
    }
    else
    {
        dbg_usb_out_pending_cycle = rx_cycle;
    }
}

void audio_diagnostics_record_usb_out_fifo(uint16_t fifo_count)
{
    if (fifo_count < dbg_usb_out_fifo_min)
    {
        dbg_usb_out_fifo_min = fifo_count;
    }
    if (fifo_count > dbg_usb_out_fifo_max)
    {
        dbg_usb_out_fifo_max = fifo_count;
    }
}

uint32_t audio_diagnostics_usb_out_pending_cycle(void)
{
    return dbg_usb_out_pending_cycle;
}

void audio_diagnostics_record_usb_out_service(uint32_t pending_cycle)
{
    const uint32_t service_cycles = DWT->CYCCNT - pending_cycle;
    if (service_cycles < dbg_usb_out_service_cycles_min)
    {
        dbg_usb_out_service_cycles_min = service_cycles;
    }
    if (service_cycles > dbg_usb_out_service_cycles_max)
    {
        dbg_usb_out_service_cycles_max = service_cycles;
    }
}

void audio_diagnostics_record_usb_out_read(bool streaming, uint16_t bytes)
{
    dbg_usb_read_bytes += bytes;
    if (streaming && bytes == 0u)
    {
        dbg_usb_read_zero_events++;
    }
    if (bytes < dbg_usb_read_size_min)
    {
        dbg_usb_read_size_min = bytes;
    }
    if (bytes > dbg_usb_read_size_max)
    {
        dbg_usb_read_size_max = bytes;
    }
}

void audio_diagnostics_record_usb_in_packet(uint16_t bytes)
{
    dbg_usb_in_packet_events++;
    dbg_usb_in_packet_bytes += bytes;
    if (bytes == 0u)
    {
        dbg_usb_in_packet_zero_events++;
    }
    if (bytes < dbg_usb_in_packet_size_min)
    {
        dbg_usb_in_packet_size_min = bytes;
    }
    if (bytes > dbg_usb_in_packet_size_max)
    {
        dbg_usb_in_packet_size_max = bytes;
    }
}

void audio_diagnostics_record_usb_in_notify(void)
{
    dbg_usb_in_notify_events++;
}

void audio_diagnostics_record_usb_in_source_wait(void)
{
    dbg_usb_in_source_wait_events++;
}

void audio_diagnostics_record_usb_in_write(uint16_t written, uint16_t requested)
{
    dbg_usb_in_write_bytes += written;
    if (written == 0U)
    {
        dbg_usb_in_write_zero_events++;
    }
    else if (written < requested)
    {
        dbg_usb_in_write_partial_events++;
    }
}

void audio_diagnostics_record_usb_in_fifo(uint16_t fifo_count)
{
    if (fifo_count < dbg_usb_in_fifo_min)
    {
        dbg_usb_in_fifo_min = fifo_count;
    }
    if (fifo_count > dbg_usb_in_fifo_max)
    {
        dbg_usb_in_fifo_max = fifo_count;
    }
}
#endif

#if AUDIO_DIAG_LOG
// deadline_cyclesの表示用換算。未計測(0)と期限なし(UINT32_MAX)は0で表示する。
static uint32_t audio_diag_deadline_us(uint32_t deadline_cycles)
{
    if ((deadline_cycles == 0u) || (deadline_cycles == UINT32_MAX))
    {
        return 0u;
    }
    return audio_diag_cycles_to_us(deadline_cycles);
}

// DMA処理完了時間の1秒周期サマリー。計測値はAudio Task contextだけが更新する。
static void audio_diag_log_tx_dma_time(void)
{
    SEGGER_RTT_printf(0,
                      "[AUD][TX-DMA-TIME] proc_us half/cplt=%lu/%lu complete_us half/cplt=%lu/%lu complete_deadline_us half/cplt=%lu/%lu overruns half/cplt=%lu/%lu\r\n",
                      (unsigned long) audio_diag_cycles_to_us(g_audio_tx_diagnostics.half_process_cycles_max),
                      (unsigned long) audio_diag_cycles_to_us(g_audio_tx_diagnostics.cplt_process_cycles_max),
                      (unsigned long) audio_diag_cycles_to_us(g_audio_tx_diagnostics.half_complete_cycles_max),
                      (unsigned long) audio_diag_cycles_to_us(g_audio_tx_diagnostics.cplt_complete_cycles_max),
                      (unsigned long) audio_diag_deadline_us(g_audio_tx_diagnostics.half_complete_deadline_cycles_at_max),
                      (unsigned long) audio_diag_deadline_us(g_audio_tx_diagnostics.cplt_complete_deadline_cycles_at_max),
                      (unsigned long) g_audio_tx_diagnostics.half_complete_deadline_overruns,
                      (unsigned long) g_audio_tx_diagnostics.cplt_complete_deadline_overruns);
}

static void audio_diag_log_rx_dma_time(void)
{
    SEGGER_RTT_printf(0,
                      "[AUD][RX-DMA-TIME] proc_us half/cplt=%lu/%lu complete_us half/cplt=%lu/%lu complete_deadline_us half/cplt=%lu/%lu overruns half/cplt=%lu/%lu\r\n",
                      (unsigned long) audio_diag_cycles_to_us(g_audio_rx_diagnostics.rx_half_process_cycles_max),
                      (unsigned long) audio_diag_cycles_to_us(g_audio_rx_diagnostics.rx_cplt_process_cycles_max),
                      (unsigned long) audio_diag_cycles_to_us(g_audio_rx_diagnostics.rx_half_complete_cycles_max),
                      (unsigned long) audio_diag_cycles_to_us(g_audio_rx_diagnostics.rx_cplt_complete_cycles_max),
                      (unsigned long) audio_diag_deadline_us(g_audio_rx_diagnostics.rx_half_complete_deadline_cycles_at_max),
                      (unsigned long) audio_diag_deadline_us(g_audio_rx_diagnostics.rx_cplt_complete_deadline_cycles_at_max),
                      (unsigned long) g_audio_rx_diagnostics.rx_half_complete_deadline_overruns,
                      (unsigned long) g_audio_rx_diagnostics.rx_cplt_complete_deadline_overruns);
}
#endif

void audio_diagnostics_log_periodic(uint32_t sample_rate_hz,
                                    uint32_t task_frequency_hz,
                                    bool streaming_out,
                                    bool streaming_in,
                                    int32_t tx_used_words)
{
#if AUDIO_DIAG_LOG
    if (!streaming_out && !streaming_in)
    {
        return;
    }

    // USB OUT停止中（USB INのみ等）も、いずれかのstream動作中は
    // TX/RX両方向の完了時間を出力する。
    if (!streaming_out)
    {
        audio_diag_log_tx_dma_time();
        audio_diag_log_rx_dma_time();
        return;
    }

    uint32_t sigma_calls = sigma_spi_it_write_calls;
    uint32_t sigma_err   = sigma_spi_it_write_errors;
    uint32_t sigma_to    = sigma_spi_it_write_timeouts;
    uint32_t sigma_mto   = sigma_spi_it_mutex_timeouts;
    SEGGER_RTT_printf(0,
                      "[AUD][SUMMARY] sample_rate=%lu task_hz=%lu\r\n",
                      (unsigned long) sample_rate_hz,
                      (unsigned long) task_frequency_hz);
    SEGGER_RTT_printf(0,
                      "[AUD][TX-BUF] used=%ld min/max=%lu/%lu\r\n",
                      (long) tx_used_words,
                      (unsigned long) ((dbg_tx_used_min == DBG_MIN_U32_INIT) ? 0u : dbg_tx_used_min),
                      (unsigned long) dbg_tx_used_max);
    SEGGER_RTT_printf(0,
                      "[AUD][TX-EVENT] underrun=%lu partial=%lu drift_up/down=%lu/%lu\r\n",
                      (unsigned long) dbg_tx_underrun_events,
                      (unsigned long) dbg_tx_partial_fill_events,
                      (unsigned long) dbg_tx_drift_up_events,
                      (unsigned long) dbg_tx_drift_dn_events);
    SEGGER_RTT_printf(0,
                      "[AUD][TX-PRIME] wait=%lu complete=%lu drift_thr(up/down)=%lu/%lu drift_sup(up/down)=%lu/%lu\r\n",
                      (unsigned long) g_audio_tx_diagnostics.priming_wait_events,
                      (unsigned long) g_audio_tx_diagnostics.priming_completed_events,
                      (unsigned long) g_audio_tx_diagnostics.drift_up_threshold_events,
                      (unsigned long) g_audio_tx_diagnostics.drift_down_threshold_events,
                      (unsigned long) g_audio_tx_diagnostics.drift_up_suppressed_events,
                      (unsigned long) g_audio_tx_diagnostics.drift_down_suppressed_events);
    SEGGER_RTT_printf(0,
                      "[AUD][USB-READ] zero=%lu bytes=%lu size_min/max=%u/%u\r\n",
                      (unsigned long) dbg_usb_read_zero_events,
                      (unsigned long) dbg_usb_read_bytes,
                      (unsigned int) ((dbg_usb_read_size_min == DBG_MIN_U16_INIT) ? 0u : dbg_usb_read_size_min),
                      (unsigned int) dbg_usb_read_size_max);
    SEGGER_RTT_printf(0,
                      "[AUD][USB-IN-PKT] count=%lu zero=%lu bytes=%lu size_min/max=%u/%u\r\n",
                      (unsigned long) dbg_usb_in_packet_events,
                      (unsigned long) dbg_usb_in_packet_zero_events,
                      (unsigned long) dbg_usb_in_packet_bytes,
                      (unsigned int) ((dbg_usb_in_packet_size_min == DBG_MIN_U16_INIT) ? 0u : dbg_usb_in_packet_size_min),
                      (unsigned int) dbg_usb_in_packet_size_max);
    SEGGER_RTT_printf(0,
                      "[AUD][USB-IN-WR] notify=%lu wait=%lu zero=%lu partial=%lu\r\n",
                      (unsigned long) dbg_usb_in_notify_events,
                      (unsigned long) dbg_usb_in_source_wait_events,
                      (unsigned long) dbg_usb_in_write_zero_events,
                      (unsigned long) dbg_usb_in_write_partial_events);
    SEGGER_RTT_printf(0,
                      "[AUD][USB-IN-FIFO] bytes=%lu min/max=%u/%u\r\n",
                      (unsigned long) dbg_usb_in_write_bytes,
                      (unsigned int) ((dbg_usb_in_fifo_min == DBG_MIN_U16_INIT) ? 0u : dbg_usb_in_fifo_min),
                      (unsigned int) dbg_usb_in_fifo_max);
    SEGGER_RTT_printf(0,
                      "[AUD][REWRITE] tx_half/cplt=%lu/%lu rx_half/cplt=%lu/%lu\r\n",
                      (unsigned long) dbg_tx_half_rewrite_events,
                      (unsigned long) dbg_tx_cplt_rewrite_events,
                      (unsigned long) dbg_rx_half_rewrite_events,
                      (unsigned long) dbg_rx_cplt_rewrite_events);
    SEGGER_RTT_printf(0,
                      "[AUD][SAI] dma_err=%lu tx_err=%lu rx_err=%lu\r\n",
                      (unsigned long) dbg_dma_err_events,
                      (unsigned long) dbg_sai_tx_err_events,
                      (unsigned long) dbg_sai_rx_err_events);
    SEGGER_RTT_printf(0,
                      "[AUD][SAI-REG] tx_err=0x%08lX rx_err=0x%08lX tx_sr=0x%08lX rx_sr=0x%08lX\r\n",
                      (unsigned long) dbg_sai_tx_last_err,
                      (unsigned long) dbg_sai_rx_last_err,
                      (unsigned long) dbg_sai_tx_sr_flags,
                      (unsigned long) dbg_sai_rx_sr_flags);
    SEGGER_RTT_printf(0,
                      "[AUD][RX-DIAG] half/cplt=%lu/%lu rewrite=%lu/%lu drop_events=%lu dropped=%lu\r\n",
                      (unsigned long) g_audio_rx_diagnostics.rx_half_callbacks,
                      (unsigned long) g_audio_rx_diagnostics.rx_cplt_callbacks,
                      (unsigned long) g_audio_rx_diagnostics.rx_half_rewrite_events,
                      (unsigned long) g_audio_rx_diagnostics.rx_cplt_rewrite_events,
                      (unsigned long) g_audio_rx_diagnostics.rx_both_pending_events,
                      (unsigned long) g_audio_rx_diagnostics.rx_dma_events_dropped);
    SEGGER_RTT_printf(0,
                      "[AUD][DEADLINE] tx_half/cplt=%lu/%lu rx_half/cplt=%lu/%lu\r\n",
                      (unsigned long) g_audio_tx_diagnostics.half_deadline_overruns,
                      (unsigned long) g_audio_tx_diagnostics.cplt_deadline_overruns,
                      (unsigned long) g_audio_rx_diagnostics.rx_half_deadline_overruns,
                      (unsigned long) g_audio_rx_diagnostics.rx_cplt_deadline_overruns);
    SEGGER_RTT_printf(0,
                      "[AUD][RX-RING] discard=%lu words=%lu full=%lu last=%lu\r\n",
                      (unsigned long) g_audio_rx_diagnostics.rx_ring_discard_events,
                      (unsigned long) g_audio_rx_diagnostics.rx_ring_discard_words,
                      (unsigned long) g_audio_rx_diagnostics.rx_ring_full_discards,
                      (unsigned long) g_audio_rx_diagnostics.rx_last_discard_words);
    SEGGER_RTT_printf(0,
                      "[AUD][RECOVERY] req=%lu attempt=%lu ok=%lu fail=%lu consec=%lu latched=%lu cause=0x%02lX stage=%lu\r\n",
                      (unsigned long) g_audio_recovery_diagnostics.request_count,
                      (unsigned long) g_audio_recovery_diagnostics.attempt_count,
                      (unsigned long) g_audio_recovery_diagnostics.success_count,
                      (unsigned long) g_audio_recovery_diagnostics.failure_count,
                      (unsigned long) g_audio_recovery_diagnostics.consecutive_failures,
                      (unsigned long) g_audio_recovery_diagnostics.latched,
                      (unsigned long) g_audio_recovery_diagnostics.last_cause_mask,
                      (unsigned long) g_audio_recovery_diagnostics.last_failed_stage);
    SEGGER_RTT_printf(0,
                      "[AUD][RATE] state=%lu applied=%lu valid=%lu clk_valid=%lu target=%lu seq=%lu attempt/ok/fail/noop=%lu/%lu/%lu/%lu result=%lu stage=%lu hal=0x%08lX aux=0x%08lX cleanup=0x%02lX\r\n",
                      (unsigned long) g_audio_rate_switch_diagnostics.state,
                      (unsigned long) g_audio_rate_switch_diagnostics.last_applied_hz,
                      (unsigned long) g_audio_rate_switch_diagnostics.applied_valid,
                      (unsigned long) g_audio_rate_switch_diagnostics.clock_valid,
                      (unsigned long) g_audio_rate_switch_diagnostics.last_target_hz,
                      (unsigned long) g_audio_rate_switch_diagnostics.last_sequence,
                      (unsigned long) g_audio_rate_switch_diagnostics.attempt_count,
                      (unsigned long) g_audio_rate_switch_diagnostics.success_count,
                      (unsigned long) g_audio_rate_switch_diagnostics.failure_count,
                      (unsigned long) g_audio_rate_switch_diagnostics.noop_count,
                      (unsigned long) g_audio_rate_switch_diagnostics.last_failed_result,
                      (unsigned long) g_audio_rate_switch_diagnostics.last_failed_stage,
                      (unsigned long) g_audio_rate_switch_diagnostics.last_failed_hal_status,
                      (unsigned long) g_audio_rate_switch_diagnostics.last_failed_aux_status,
                      (unsigned long) g_audio_rate_switch_diagnostics.last_cleanup_status);
    SEGGER_RTT_printf(0,
                      "[AUD][SPI] calls=%lu errors=%lu timeouts=%lu mutex_timeouts=%lu\r\n",
                      (unsigned long) (sigma_calls - dbg_sigma_calls_prev),
                      (unsigned long) (sigma_err - dbg_sigma_err_prev),
                      (unsigned long) (sigma_to - dbg_sigma_to_prev),
                      (unsigned long) (sigma_mto - dbg_sigma_mto_prev));
    SEGGER_RTT_printf(0,
                      "[AUD][USB-OUT-PKT] packets=%lu bytes=%lu size_min/max=%u/%u\r\n",
                      (unsigned long) dbg_usb_out_packet_events,
                      (unsigned long) dbg_usb_out_packet_bytes,
                      (unsigned int) ((dbg_usb_out_packet_size_min == DBG_MIN_U16_INIT) ? 0u : dbg_usb_out_packet_size_min),
                      (unsigned int) dbg_usb_out_packet_size_max);
    SEGGER_RTT_printf(0,
                      "[AUD][USB-OUT-FIFO] min/max=%u/%u\r\n",
                      (unsigned int) ((dbg_usb_out_fifo_min == DBG_MIN_U16_INIT) ? 0u : dbg_usb_out_fifo_min),
                      (unsigned int) dbg_usb_out_fifo_max);
    SEGGER_RTT_printf(0,
                      "[AUD][USB-OUT-GAP] us_min/max=%lu/%lu late=%lu coalesced=%lu\r\n",
                      (unsigned long) ((dbg_usb_out_gap_cycles_min == DBG_MIN_U32_INIT) ? 0u : audio_diag_cycles_to_us(dbg_usb_out_gap_cycles_min)),
                      (unsigned long) audio_diag_cycles_to_us(dbg_usb_out_gap_cycles_max),
                      (unsigned long) dbg_usb_out_gap_late_events,
                      (unsigned long) dbg_usb_out_coalesced_events);
    SEGGER_RTT_printf(0,
                      "[AUD][USB-OUT-SERVICE] us_min/max=%lu/%lu\r\n",
                      (unsigned long) ((dbg_usb_out_service_cycles_min == DBG_MIN_U32_INIT) ? 0u : audio_diag_cycles_to_us(dbg_usb_out_service_cycles_min)),
                      (unsigned long) audio_diag_cycles_to_us(dbg_usb_out_service_cycles_max));
    dbg_sigma_calls_prev = sigma_calls;
    dbg_sigma_err_prev   = sigma_err;
    dbg_sigma_to_prev    = sigma_to;
    dbg_sigma_mto_prev   = sigma_mto;

    // 両方向の完了時間。いずれかのstream動作中に出力する。
    audio_diag_log_tx_dma_time();
    audio_diag_log_rx_dma_time();
#else
    (void) sample_rate_hz;
    (void) task_frequency_hz;
    (void) streaming_out;
    (void) streaming_in;
    (void) tx_used_words;
#endif
}
